# # 語法：open(file, mode="模式")
#
# # r (read)唯讀模式
# # w (write)寫入(覆寫)模式
# # a (append)寫入(續寫)模式
#
# # ------------------------------------------------------
#
# # 【唯讀模式】
#
# f = open("file.txt", "r")    # 打開檔案，唯讀模式
#
# print(f.read())              # 印出 Hello This is file content!!
#
# f.close()                    # 記得要關閉檔案，不然會造成奇怪問題
#
# # ------------------------------------------------------
#
# # 【覆寫模式】
#
# f = open("file.txt", "w", encoding = "utf-8")    # 打開檔案，覆寫模式 # 需修改編碼提示
#
# f.write("Write file!")                           # 不會印出，但會直接覆寫原檔案
#
# f.close()                                        # 記得要關閉檔案，不然會造成奇怪問題
#
# # -----------------------------------------------------
#
# f = open('file.txt', 'a', encoding= 'utf-8') # 打開檔案，續寫模式 # 需修改編碼提示
#
# f.write('今天星期五，要放4天假，真的很開心~')      # 不會印出，但會直接覆寫原檔案
#
# f.close()                                    # 記得要關閉檔案，不然會造成很奇怪的問題
#
# # -----------------------------------------------------
#
# # 【建議開啟方式，不用擔心忘記關閉】
#
# # 使用with open，可自動關閉
#
# with open('file.txt', 'a', encoding= 'utf-8') as f:
#     f.write('OH~~~')