# # 【python 變數宣告】
# # a = "123"
# # b = "123"
# # c = 1
# # d = True
#
# # -------------------------------------------------
#
# # 【變數命名規則】
# # 只能包含英文、數字、底線
# # 變數名稱不能有空格，通常用底線替代
# # 不能是保留字
# # 英文大小寫不同就可以為不同變數名稱
#
# # -------------------------------------------------
#
# # 【python 變數的賦值】
a = 100 + 200
print(a)       # 印出 300
#
# # -------------------------------------------------
#
# # 【python 資料型別】
# # numeric - int, float
# # boolean - bool
# # string - str
# # container - list, set, dict, tuple