# # 【int 字串轉換為整數】
# # 語法：int(str)
# str_num = "123"
# print(type(int(str_num)))   # 印出 <class 'int'>
#
# a = int(input())
# b = a - 1911
# print(b)
#
# a = "100"
# print(a)                   # 印出 100
# print(type(a))             # 印出 <class 'str'>
# b = int(a)
# print(b)                   # 印出 100
# print(type(b))             # 印出 <class 'int'>
#
# # -------------------------------------------------
#
# # 【round 四捨五入】
# # 語法：round(數值, 小數點後幾位)
# print(round(123.456789, 2))    # 印出 123.46
#
# # -------------------------------------------------
#
# # 【max 找最大值】
# # 語法：max(數值1, 數值2, 數值3...)
# # 語法：max([list])
# print(max(1, 2, 3, 4, 5))      # 印出 5
# print(max([1, 2, 3, 4, 5]))    # 印出 5
#
# print(max(1, 34, 546, 7, 32, 5, 45, 643, 75, 43))  # 印出 643
#
# # -------------------------------------------------
#
# # 【min 找最小值】
# # 語法：min(數值1, 數值2, 數值3...)
# # 語法：min([list])
# print(min(1, 2, 3, 4, 5))       # 印出 1
# print(min([1, 2, 3, 4, 5]))     # 印出 1
#
# print(min(1, 34, 546, 7, 32, 5, 45, 643, 75, 43))  # 印出 1
#
# # -------------------------------------------------
#
# # 【abs 取絕對值】
# # 語法：abs()
# print(abs(-199))               # 印出 199
#
# # -------------------------------------------------
#
# # 【pow 次方】
# # 語法：pow(x, y)
# print(pow(2, 3))               # 印出 8
#
# print(pow(2, 10))              # 印出 1024
# print(2 ** 10)                 # 印出 1024
#
# print(100 ** 0.5)              #開根號，印出 10
#
# # -------------------------------------------------
#
# #【math】模組
#
# # 【ceil 整數，無條件進位】
# # 語法：math.ceil(數值)
# 21_import math
# print(math.ceil(10.1))        # 印出 11
#
# 21_import math
# print(math.ceil(123.456))     # 印出 124
#
# # -------------------------------------------------
#
# # 【ceil 改為小數點第二位，無條件進位】
# # 語法：math.ceil(數值*100)/100
# # 若要取到小數點第二位，先乘100，再除100
# 21_import math
# print(math.ceil(123.456 * 100) / 100)    # 印出 123.46
#
# # -------------------------------------------------
#
# # 【floor 整數，無條件捨去】
# # 語法：math.floor(數值)
# 21_import math
# print(math.floor(10.1))      # 印出 10
#
# 21_import math
# print(math.floor(123.456))   # 印出 123
#
# # -------------------------------------------------
#
# # 【floor 改為小數點第二位，無條件捨去】
# # 語法：math.floor(數值*100)/100
# # 若要取到小數點第二位，先乘100，再除100
# 21_import math
# print(math.floor(123.456 * 100) / 100)    # 印出 123.45
#
# # -------------------------------------------------
#
# # 【random 模組】
#
# # 【randint 隨機抽取數值】
# # 語法：randint(開始, 結束) →開始<=x<=結束
# 21_import random
# print(random.randint(0, 5))         # 印出 4 (0~5)
#
# # -------------------------------------------------
#
# # 【randrange 隨機抽取數值(跳數)】
# # 語法：randrange(開始, 結束, 幾個一跳) →開始<=x<=結束(不包含結尾)
# 21_import random
# print(random.randrange(0, 5))      # 印出 4
#
# 21_import random
# print(random.randrange(0, 10, 2))  # 0~10，2個一跳