# # 【EX2-4 三個整數中最大】
#
# # 輸入為三個由空白隔開的整數。
#
# # 輸出這三個整數中最大的那一個。
#
# # 輸入：35 26 48      輸出：48
# # 輸入：37 59 59      輸出：59
# # 輸入：37 59 100     輸出：100
#
# # ---------------------------
#
# # 方法一
# x = input()          # 輸入(為字串)
# x_sp = x.split()     # 將輸入內容分隔
# y = map(int, x_sp)   # map為進階寫法
# print(max(y))        # 列印最大值
#
# # 方法二
# x = input()          # 輸入(為字串)
# x_sp = x.split()     # 將輸入內容分隔
# print(max(int(x_sp[0]), int(x_sp[1]), int(x_sp[2])))
# # 單獨抓出為字串，調整為整數int，再用MAX找最大