# # 語法一：
# # if 條件:
# #     做事情
#
# # 語法二：
# # if 條件:
# #     做事情
# # else:
# #    做其他事
#
# # 語法三：
# # if 條件:
# #     做事情1
# # elif 條件2:
# #     做事情2
# # elif 條件3:
# #     做事情3
# # else:
# #    做其他事
#
# # ------------------------------------------------------------------------
#
# # 【範例】
# # 老婆交代：下班後買十個包子回來，如果看到賣西瓜的就買一個。
# # 老公：好。
# # 下班後帶著一個包子回家
# # 老婆：為什麼只有一個包子？
# # 老公：因為我看到賣西瓜的。
#
# by_count = 10
# see_suika = True    # 是否看到西瓜
#
# if see_suika:
#     buy_count = 1
#
# print(f"買{buy_count}個包子")
#
# # ------------------------------------------------------------------------
#
# # 可用於【確認清單內是否有東西】
# a = [123]
# if len(a) == 0:      # 從長度判斷：如果長度為0，代表沒資料
#     print("Yes")     # 印出 None
#
# a = '123'
#
# if len(a) == 0:      # 從長度判斷：如果長度為0，代表沒資料
#   print('Hi')
#
# # ------------------------------------------------------------------------
#
# age = 18
# money = 20000
#
# if age >= 18:          # 如果年紀大於18，顯示歡迎光臨
#     print("歡迎光臨")
# elif money > 10000:    # 如果年紀小於18，但是money大於10000，也顯示歡迎光臨
#     print("歡迎光臨")
# else:                  # 否則顯示謝謝惠顧
#     print("謝謝惠顧")
#
# # -----------------------------------------------------------------------
#
# # 巢狀式寫法
# age = 18
# money = 20000
#
# if age >= 18:          # 如果年紀大於18，顯示歡迎光臨
#     print("歡迎光臨")
# else:
#     if money > 10000:  # 如果年紀小於18，但是money大於10000，也顯示歡迎光臨
#         print("歡迎光臨")
#     else:              # 否則顯示謝謝惠顧
#         print("謝謝惠顧")
#
# # ------------------------------------------------------------------------
#
# # 【剪刀石頭布遊戲】
# 21_import random
#
# key_word = ["剪刀", "石頭", "布"]
#
# user = int(input("[0]剪刀, [1]石頭, [2]布："))
#
# rand_num = random.randint(0,2)
#
# print("你出：", key_word[user])
# print("電腦出1：", key_word[rand_num])
#
# if user == rand_num:
#     print("結果：平手")
# elif user == 0 and rand_num == 1:  # 剪刀-石頭
#     print("結果：你輸了")
# elif user == 0 and rand_num == 2:  # 剪刀-布
#     print("結果：你贏了")
# elif user == 1 and rand_num == 0:  # 石頭-剪刀
#     print("結果：你贏了")
# elif user == 1 and rand_num == 2:  # 石頭-布
#     print("結果：你輸了")
# elif user == 2 and rand_num == 0:  # 布-剪刀
#     print("結果：你輸了")
# else:                            # 布-石頭
#     print("結果：你贏了")
#
# ---------------------------------------------------------------
#
# # 【處理多行】
# # 語法：21_import sys
# #      x = sys.stdin.read()
#
# 21_import sys
#
# # 讀取標準輸入的所有內容
# in_txt = sys.stdin.read()
# in_txt_enter_list = in_txt.splitlines()
#
# for i in in_txt_enter_list:
#     print(i.split(" "))     # 最後輸入ctrl+D