# # 【TA1-5 練習 id 身份證字號驗證】
#
# # 今天要設計一款能夠自動判斷身分證是否合法的程式，
# # 身分證的判斷是有既定的公式的，公式如下:
#
# # 步驟
# # 1.查出英文字所代表的數字
# # 再將所查出的數字 “十位數+個位數x9”
# # 例: 台北市=10 => 1 + 0x9 =1
# # 台中市=11 => 1 + 1x9 =10
#
# # 2.N2x8 + N3x7 + N4x6 + N5x5 + N6x4 + N7x3 + N8x2 + N9x1 + N10x1
# # 將流水碼依序乘876543211
# # 一個個乘.乘完要加起來.（別忘了先乘除後加減）
# # 例: 123456789 =>
# # 1×8+2×7+3×6+4×5+5×4+6×3+7×2+8×1+9×1
#
# # 3.將步驟1 和步驟2 的兩個數加起來除以10.
# # 例:
# # 步驟1 台北計算結果 =1
# # 步驟2 1x8 + 2x7 + 3x6 + 4x5 + 5x4 + 6x3 + 7x2 + 8 + 9 =129 (1+129)/10
# # 除10後看看是否可以整除.如可以整除即為正確的身份證字號.
# # 如無法整除即是錯誤的身份證字號(1+129)/10 = 13 => 可以整除.正確
#
# # 輸入為一個長度與性別皆為正確的身分證字號，請回傳合法、不合法
#
# # 輸入：A123456789              輸出：合法
# # 輸入：A123456781              輸出：不合法
# # 輸入：W234567848              輸出：合法
# # 輸入：W234567844              輸出：不合法
#
# # ---------------------------

x = input()            # 輸入(字串)

sum = 0                # 假設總和為0

if x[0] == 'A':        # 如果第1個字等於A
    sum += 1 + 0 * 9
if x[0] == 'B':        # 如果第1個字等於B
    sum += 1 + 1 * 9
if x[0] == 'C':        # 如果第1個字等於C
    sum += 1 + 2 * 9
if x[0] == 'D':        # 如果第1個字等於D
    sum += 1 + 3 * 9
if x[0] == 'E':        # 如果第1個字等於E
    sum += 1 + 4 * 9
if x[0] == 'F':        # 如果第1個字等於F
    sum += 1 + 5 * 9
if x[0] == 'G':        # 如果第1個字等於G
    sum += 1 + 6 * 9
if x[0] == 'H':        # 如果第1個字等於H
    sum += 1 + 7 * 9
if x[0] == 'I':        # 如果第1個字等於I
    sum += 3 + 4 * 9
if x[0] == 'J':        # 如果第1個字等於J
    sum += 1 + 8 * 9
if x[0] == 'K':        # 如果第1個字等於K
    sum += 1 + 9 * 9
if x[0] == 'L':        # 如果第1個字等於L
    sum += 2 + 0 * 9
if x[0] == 'M':        # 如果第1個字等於M
    sum += 2 + 1 * 9
if x[0] == 'N':        # 如果第1個字等於N
    sum += 2 + 2 * 9
if x[0] == 'O':        # 如果第1個字等於O
    sum += 3 + 5 * 9
if x[0] == 'P':        # 如果第1個字等於P
    sum += 2 + 3 * 9
if x[0] == 'Q':        # 如果第1個字等於Q
    sum += 2 + 4 * 9
if x[0] == 'R':        # 如果第1個字等於R
    sum += 2 + 5 * 9
if x[0] == 'S':        # 如果第1個字等於S
    sum += 2 + 6 * 9
if x[0] == 'T':        # 如果第1個字等於T
    sum += 2 + 7 * 9
if x[0] == 'U':        # 如果第1個字等於U
    sum += 2 + 8 * 9
if x[0] == 'V':        # 如果第1個字等於A
    sum += 2 + 9 * 9
if x[0] == 'W':        # 如果第1個字等於A
    sum += 3 + 2 * 9
if x[0] == 'X':        # 如果第1個字等於A
    sum += 3 + 0 * 9
if x[0] == 'Y':        # 如果第1個字等於A
    sum += 3 + 1 * 9
if x[0] == 'Z':        # 如果第1個字等於Z
    sum += 3 + 3 * 9

sum += int(x[1]) * 8   # 第2個字轉為整數，乘以8
sum += int(x[2]) * 7   # 第3個字轉為整數，乘以7
sum += int(x[3]) * 6   # 第4個字轉為整數，乘以6
sum += int(x[4]) * 5   # 第5個字轉為整數，乘以5
sum += int(x[5]) * 4   # 第6個字轉為整數，乘以4
sum += int(x[6]) * 3   # 第7個字轉為整數，乘以3
sum += int(x[7]) * 2   # 第8個字轉為整數，乘以2
sum += int(x[8]) * 1   # 第9個字轉為整數，乘以1
sum += int(x[9]) * 1   # 第10個字轉為整數，乘以1

if sum % 10 == 0:      # 如果加總可以被10整除，列印合法
    print('合法')
else:                  # 如果加總無法被10整除，列印不合法
    print('不合法')