# # 【for 迴圈 格式】
# # for x in items:
# #     pass
#
# # -----------------------------------------------------------------------
#
# fruits = ["apple", "banana", "cherry"]
#
# for x in fruits:
#     print(x)
#
# # 印出
# # apple
# # banana
# # cherry
#
# # ------------------------------------------------------------------------
#
# a = ['A', 'B', 'C']
# for x in a:
#     print(x)
#
# # 印出
# # A
# # B
# # C
#
# # ------------------------------------------------------------------------
#
# # 【如果想要指定特定次數的for迴圈，可以配合range】
#
# print(list(range(0,10)))    # 印出 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
#
# # ------------------------------------------------------------------------
#
# # 【range本身可以被迭代，不用另外加list】
#
# for i in range(0, 10):
#     print(i)
#
# # 印出
# # 0
# # 1
# # 2
# # 3
# # 4
# # 5
# # 6
# # 7
# # 8
# # 9
#
# # -------------------------------------------------------
#
# for i in range(0, 10):
#     if i == 5:
#         break
#     print(i)
#
# # 印出
# # 0
# # 1
# # 2
# # 3
# # 4
#
# # -----------------------------------------------------
#
# for i in range(0, 10):
#     if i == 5:
#         continue
#     print(i)
#
# # 印出
# # 0
# # 1
# # 2
# # 3
# # 4
# # 5
# # 6
# # 7
# # 8
# # 9
#
# # -------------------------------------------------------
#
# # 【如果想要得知目前迴圈是list中的第幾個位置，可以配合enumerate】
# # 可以使用 enumerate() 函式來同時輸出索引(ex. i)與元素(ex. x)
#
# fruits = ["apple", "banana", "cherry"]
# for i,x in enumerate(fruits):
#     print(i, x)
#
# # 印出
# # 0 apple
# # 1 banana
# # 2 cherry
#
# # -------------------------------------------------------
#
# aa = ["A", "B", "C"]
# for i, a in enumerate(aa):
#     print(i, a)
#
# # 印出
# # 0 A
# # 1 B
# # 2 C
#
# # -------------------------------------------------------
#
# aa = ["A", "B", "C"]
# for i, a in enumerate(aa, start = 100):
#     print(i, a)
#
# # 印出
# # 100 A
# # 101 B
# # 102 C
#
# # -------------------------------------------------------
#
# aa = [1, 2, 3, 4]
# for i, a in enumerate(aa):
#     print(a)
#     aa[i] = 100
# print(aa)
#
# # 印出
# # 1
# # 2
# # 3
# # 4
# # [100, 100, 100, 100]
#
# # -------------------------------------------------------
#
# # 【串列生成式】
#
# # str_list = ["1", "2", "3"]
#
# # 1. 先寫個for in
# # for s in str_list
#
# # 2. 把每一圈的獨立變數拿出來
# # s
#
# # 3. 組合!
# # [s for s in str_list]
#
# # 4. 根據自己的需求調整需求
# # [int(s) for s in str_list]
#
# # -------------------------------------------------------
#
# str_list = ["1", "2", "3"]
# print([int(s) for s in str_list])
#
# # 印出 [1, 2, 3]
#
# # -------------------------------------------------------
#
# str_list = ["1", "2", "3"]
# a = []
# for s in str_list:
#     a.append(int(s) + 1)
# print(a)
#
# # 印出 [2, 3, 4]
#
# # -------------------------------------------------------
#
# print(" ".join([str(int(s) + 1) for s in input().split()]))
#
# # 輸入 2 3 4 5 6 7
# # 輸出 3 4 5 6 7 8