# # 【建立方式】
# # 使用 {} 來建立
# # 每個值中間以逗號相隔開
#
# my_dict = {"欄位名稱1": "欄位值1", "欄位名稱2": "欄位值2", ...}
#
# # 【用dict()來建立】
#
# my_dict = dict(欄位名稱1 = "欄位值1", 欄位名稱2 = "欄位值2")
#
# # 範例
# police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
#
# # -----------------------------------------------
#
# # 【使用方法】
#
# # 【取值→變數["欄位名稱"]
#
# police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
# print(police["name"])       # 印出 兩津勘吉
#
#
# 【如果取了一個不存在的值，則會發生錯誤】
#
# # police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
# # print(police["money"])    # 印出 Error
#
#
# # 【如何避免取了一個不存在的值而發生error，可用get】
# # 變數.get("欄位名稱")
#
# police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
# print(police.get("money"))      # 印出 None
#
# # 【如果以get取了一個不存在的值，會顯示後者數值】
# # 變數.get("欄位名稱",數值)
#
# police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
# print(police.get("zzz", 100))      # 印出 100
#
# # ----------------------------------------------------
#
# # 【新增、更新值 → 變數["欄位名稱"]=欄位值】
# # 如果A存在則更新值，若不存在則新增A的key值
#
# police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
# police["money"] = 10
# print(police)  # 印出 {'name': '兩津勘吉', 'height': 161, 'is_rich': False, 'money': 10}
#
# # ----------------------------------------------------
#
# # 【刪除值 → del 變數["欄位名稱"]】
#
# police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
# del police["is_rich"]
# print(police)          # 印出 {'name': '兩津勘吉', 'height': 161}
#
# # ----------------------------------------------------
#
# # 【用keys()取得所有的key值 → 變數.keys()】
#
# police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
# print(police.keys())    # 印出 dict_keys(['name', 'height', 'is_rich'])
#
# # ----------------------------------------------------
#
# # 【用values()取得所有的value值 → 變數.values()】
#
# police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
# print(police.values())     # 印出 dict_values(['兩津勘吉', 161, False])
#
# # ----------------------------------------------------
#
# # 【確認字典型別 → type(dict)】
#
# police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
# print(type(police))          # 印出 <class 'dict'>
#
# # ----------------------------------------------------
#
# # 【合併字典，可用**來展開所有的字典(**為把大括號拔掉)→**變數1,**變數2】
# # 注意：若key值相同，僅會保留其中之一
#
# police = {"name": "兩津勘吉", "height": 161, "is_rich": False}
# police_house = {"country": "日本", "city": "東京龜有"}
# print({**police, **police_house})
# # 印出 {'name': '兩津勘吉', 'height': 161, 'is_rich': False, 'country': '日本', 'city': '東京龜有'}
#
# # -----------------------------------------------------
#
# # 【合併清單，可用*來展開所有的清單(*為把中括號拔掉) → *變數1,*變數2】
#
# a = [1, 2, 3]
# b = [4, 5, 6]
# c = [*a, *b]
# print(c)                    # 印出 [1, 2, 3, 4, 5, 6]
#
# # ------------------------------------------------------
#
# # 【拿掉清單的括號+逗號，可用*(*為把中括號拔掉) → *變數】
#
# a = [1, 2, 3, 4]
# print(a)              # 印出 [1, 2, 3, 4]
#
# a = [1, 2, 3, 4]
# print(*a)             # 印出 1 2 3 4
#
# # --------------------------------------------------
#
# # 【拿掉清單的括號+逗號，並改用別的符號分隔，可用*、sep(*為把中括號拔掉)→*變數, sep = ‘符號 ’】
#
# a = [1, 2, 3, 4]
# print(*a, sep = '~')   # 印出 1~2~3~4
#
# # --------------------------------------------------
#
# # 【將dict轉為json】
# # dict: {"key":100}
# # json: "{"key":100}"
# # 注意：如果裡面用單引號，外面必須使用雙引號
#
# # --------------------------------------------------
#
# # 【list和dict比較】
# # list：很多一樣的東西
# # dict：很複雜的東西
#
# # --------------------------------------------------
#
# hsinchu ={
#     "名稱": "新竹",
#     "人口": 200_000,    # 三個零可以加一底線，方便識別
#     "是否是首都": False
# }
#
# taipei = {
#     "名稱": "台北",
#     "人口": 400_000,
#     "是否是首都": True
# }
#
# taiwan = [hsinchu, taipei]
#
# # print(taiwan)    # 印出為清單
# #
# # # 印出
# # # [{'名稱': '新竹', '人口': 200000, '是否是首都': False}, {'名稱': '台北', '人口': 400000, '是否是首都': True}]
#
# # ---------------------------------------------------
#
# # 查詢【台灣第一個地區】
#
# print(taiwan[0])     # 字典  # 印出 {'名稱': '新竹', '人口': 200000, '是否是首都': False}
# #
# # 查詢【台灣第一個地區的名稱】
#
# print(taiwan[0]["名稱"])     # 印出 新竹
#
# # -------------------------------------------------
#
# # 查詢【地球的日本的第二個地區的人口數】
#
# taipei = {
#     '名稱': '台北',
#     '人口': 2_000_000,  #三個零可以加一底線，方便識別
#     # '是否是首都': True
# }
#
# hsinchu = {
#     '名稱': '新竹',
#     '人口': 1_000_000,
#     '是否是首都': False
# }
#
# taiwan = [taipei, hsinchu]
#
# tokyo = {
#     '名稱': '東京',
#     '人口': 1_000_000,  #三個零可以加一底線，方便識別
#     '是否是首都': True
# }
#
# osaka = {
#     '名稱': '大阪',
#     '人口': 9_000_000,
#     '是否是首都': False
# }
#
# japan = [tokyo, osaka]
#
# earth = {
#     'japan': japan,
#     'taiwan': taiwan,
# }
#
# earth['japan'][1] # 字典
#
# print(earth['japan'][1]['人口'])  #地球的日本的第二個地區的人口數 # 印出 9000000
#
# # ------------------------------------------------
#
# # 【計算一字串中各文字出現的次數】
#
# aa = 'alksdjlaksflkj;vbidjdf;slkfjs;lkdjblkjsldkjflirerujopsijdflkj;sdlfiu;kejl;fsdkjff'
#
# c = {} #空字典
#
# for i in aa:
#     if i not in c:     #如果字不再字典內，該字數量=1
#         c[i] = 1
#     else:
#         c[i] += 1      #如果字在字典內，該字數量+1
#
# print(c)
# # 印出
# # {'a': 2, 'l': 11, 'k': 10, 's': 8, 'd': 8, 'j': 12, 'f': 9, ';': 6, 'v': 1, 'b': 2, 'i': 4, 'r': 2, 'e': 2, 'u': 2, 'o': 1, 'p': 1}